__mod_name__ = "𝚃ᴏᴏʟs 🧮"

__help__ = """
❂ /markdownhelp*:* ϙᴜɪᴄᴋ ꜱᴜᴍᴍᴀʀʏ ᴏғ ʜᴏᴡ ᴍᴀʀᴋᴅᴏᴡɴ ᴡᴏʀᴋꜱ ɪɴ ᴛᴇʟᴇɢʀᴀᴍ - ᴄᴀɴ ᴏɴʟʏ ʙᴇ ᴄᴀʟʟᴇᴅ ɪɴ ᴘʀɪᴠᴀᴛᴇ ᴄʜᴀᴛꜱ

❂ /paste*:* ꜱᴀᴠᴇꜱ ʀᴇᴘʟɪᴇᴅ ᴄᴏɴᴛᴇɴᴛ ᴛᴏ ɴᴇᴋᴏʙɪɴ.ᴄᴏᴍ ᴀɴᴅ ʀᴇᴘʟɪᴇꜱ ᴡɪᴛʜ ᴀ ᴜʀʟ

❂ /react*:* ʀᴇᴀᴄᴛꜱ ᴡɪᴛʜ ᴀ ʀᴀɴᴅᴏᴍ ʀᴇᴀᴄᴛɪᴏɴ 

❂ /ud <word>*:* ᴛʏᴘᴇ ᴛʜᴇ word ᴏʀ ᴇxᴘʀᴇꜱꜱɪᴏɴ ʏᴏᴜ ᴡᴀɴᴛ ᴛᴏ ꜱᴇᴀʀᴄʜ ᴜꜱᴇ

❂ /reverse*:* ᴅᴏᴇꜱ ᴀ ʀᴇᴠᴇʀꜱᴇ ɪᴍᴀɢᴇ ꜱᴇᴀʀᴄʜ ᴏғ ᴛʜᴇ ᴍᴇᴅɪᴀ ᴡʜɪᴄʜ it ᴡᴀꜱ ʀʀᴇᴘʟɪᴇᴅ ᴛᴏ

❂ /wiki <query>*:* ᴡɪᴋɪᴘᴇᴅɪᴀ ʏᴏᴜʀ ϙᴜᴇʀʏ

❂ /wall <query>*:* ɢᴇᴛ ᴀ ᴡᴀʟʟᴘᴀᴘᴇʀ ғʀᴏᴍ wall.alphacoders.com

❂ /cash*:* ᴄᴜʀʀᴇɴᴄʏ ᴄᴏɴᴠᴇʀᴛᴇʀ

 *Example:*
 /cash 1 ᴜꜱᴅ ɪɴʀ
      _ᴏʀ_
 /cash 1 usd inr
 Output: 1.0 ᴜꜱᴅ = 75.505 ɪɴʀ
 
"""
