# ADMINS COMMANDS
admin_cmd = """✅ᴀᴅᴍɪɴ ᴄᴏᴍᴍᴀɴᴅꜱ:
c ꜱᴛᴀɴᴅꜱ ғᴏʀ ᴄʜᴀɴɴᴇʟ ᴘʟᴀʏ.

/pause or /cpause - ᴘᴀᴜꜱᴇ ᴛʜᴇ ᴘʟᴀʏɪɴɢ ᴍᴜꜱɪᴄ.
/resume or /cresume- ʀᴇꜱᴜᴍᴇ ᴛʜᴇ ᴘᴀᴜꜱᴇᴅ ᴍᴜꜱɪᴄ.
/amute or /cmute- ᴍᴜᴛᴇ ᴛʜᴇ ᴘʟᴀʏɪɴɢ ᴍᴜꜱɪᴄ.
/aunmute or /cunmute- ᴜɴᴍᴜᴛᴇ ᴛʜᴇ ᴍᴜᴛᴇᴅ ᴍᴜꜱɪᴄ.
/skip or /cskip- ꜱᴋɪᴘ ᴛʜᴇ ᴄᴜʀʀᴇɴᴛ ᴘʟᴀʏɪɴɢ ᴍᴜꜱɪᴄ.
/stop or /cstop- ꜱᴛᴏᴘ ᴛʜᴇ ᴘʟᴀʏɪɴɢ ᴍᴜꜱɪᴄ.
/shuffle or /cshuffle- ʀᴀɴᴅᴏᴍʟʏ ꜱʜᴜғғʟᴇꜱ ᴛʜᴇ ϙᴜᴇᴜᴇᴅ ᴘʟᴀʏʟɪꜱᴛ.
/seek or /cseek - ғᴏʀᴡᴀʀᴅ ꜱᴇᴇᴋ ᴛʜᴇ ᴍᴜꜱɪᴄ ᴛᴏ ʏᴏᴜʀ ᴅᴜʀᴀᴛɪᴏɴ
/seekback or /cseekback - ʙᴀᴄᴋᴡᴀʀᴅ ꜱᴇᴇᴋ ᴛʜᴇ ᴍᴜꜱɪᴄ ᴛᴏ ʏᴏᴜʀ ᴅᴜʀᴀᴛɪᴏɴ
/restart - ʀᴇꜱᴛᴀʀᴛ ʙᴏᴛ ғᴏʀ ʏᴏᴜʀ ᴄʜᴀᴛ .

✅ꜱᴘᴇᴄɪғɪᴄ ꜱᴋɪᴘ:
/skip or /cskip [ɴᴜᴍʙᴇʀ(ᴇxᴀᴍᴘʟᴇ: 3)] 
    - ꜱᴋɪᴘꜱ ᴍᴜꜱɪᴄ ᴛᴏ ᴀ ᴛʜᴇ ꜱᴘᴇᴄɪғɪᴇᴅ ϙᴜᴇᴜᴇᴅ ɴᴜᴍʙᴇʀ. ᴇxᴀᴍᴘʟᴇ: /skip 3 ᴡɪʟʟ ꜱᴋɪᴘ ᴍᴜꜱɪᴄ ᴛᴏ ᴛʜɪʀᴅ ϙᴜᴇᴜᴇᴅ ᴍᴜꜱɪᴄ ᴀɴᴅ ᴡɪʟʟ ɪɢɴᴏʀᴇ 1 ᴀɴᴅ 2 ᴍᴜꜱɪᴄ ɪɴ ϙᴜᴇᴜᴇ.

✅ʟᴏᴏᴘ ᴘʟᴀʏ:
/loop or /cloop [ᴇɴᴀʙʟᴇ/ᴅɪꜱᴀʙʟᴇ] ᴏʀ [ɴᴜᴍʙᴇʀꜱ ʙᴇᴛᴡᴇᴇɴ 1-10] 
    - ᴡʜᴇɴ ᴀᴄᴛɪᴠᴀᴛᴇᴅ, ʙᴏᴛ ʟᴏᴏᴘꜱ ᴛʜᴇ ᴄᴜʀʀᴇɴᴛ ᴘʟᴀʏɪɴɢ ᴍᴜꜱɪᴄ ᴛᴏ 1-10 ᴛɪᴍᴇꜱ ᴏɴ ᴠᴏɪᴄᴇ ᴄʜᴀᴛ. ᴅᴇғᴀᴜʟᴛ ᴛᴏ 10 ᴛɪᴍᴇꜱ.

✅ᴀᴜᴛʜ ᴜꜱᴇʀꜱ:
ᴀᴜᴛʜ Users can ᴜꜱᴇ ᴀᴅᴍɪɴ ᴄᴏᴍᴍᴀɴᴅꜱ ᴡɪᴛʜᴏᴜᴛ ᴀᴅᴍɪɴ ʀɪɢʜᴛꜱ ɪɴ ʏᴏᴜʀ ᴄʜᴀᴛ.

/auth [Username] - ᴀᴅᴅ ᴀ ᴜꜱᴇʀ ᴛᴏ ᴀᴜᴛʜ ʟɪꜱᴛ ᴏғ ᴛʜᴇ ɢʀᴏᴜᴘ.
/unauth [Username] - ʀᴇᴍᴏᴠᴇ a ᴜꜱᴇʀ ғʀᴏᴍ ᴀᴜᴛʜ LIST ᴏғ ᴛʜᴇ ɢʀᴏᴜᴘ.
/authusers - Check AUTH LIST of the group."""


# PLAYER COMMANDS
play_cmd = """✅ᴘʟᴀʏ ᴄᴏᴍᴍᴀɴᴅꜱ:

ᴀᴠᴀɪʟᴀʙʟᴇ ᴄᴏᴍᴍᴀɴᴅꜱ = play , vplay , cplay

ғᴏʀᴄᴇᴘʟᴀʏ ᴄᴏᴍᴍᴀɴᴅꜱ = playforce , vplayforce , cplayforce

c ꜱᴛᴀɴᴅꜱ ғᴏʀ ᴄʜᴀɴɴᴇʟ ᴘʟᴀʏ.
v ꜱᴛᴀɴᴅꜱ ғᴏʀ ᴠɪᴅᴇᴏ ᴘʟᴀʏ.
ғᴏʀᴄᴇ ꜱᴛᴀɴᴅꜱ ғᴏʀ ғᴏʀᴄᴇ ᴘʟᴀʏ.

/play or /vplay or /cplay  - ʙᴏᴛ ᴡɪʟʟ ꜱᴛᴀʀᴛ ᴘʟᴀʏɪɴɢ ʏᴏᴜʀ ɢɪᴠᴇɴ ϙᴜᴇʀʏ on ᴠᴏɪᴄᴇ ᴄʜᴀᴛ ᴏʀ ꜱᴛʀᴇᴀᴍ ʟɪᴠᴇ ʟɪɴᴋꜱ ᴏɴ ᴠᴏɪᴄᴇ ᴄʜᴀᴛꜱ.

/playforce or /vplayforce or /cplayforce -  ғᴏʀᴄᴇ ᴘʟᴀʏ ꜱᴛᴏᴘꜱ ᴛʜᴇ ᴄᴜʀʀᴇɴᴛ ᴘʟᴀʏɪɴɢ ᴛʀᴀᴄᴋ ᴏɴ ᴠᴏɪᴄᴇ ᴄʜᴀᴛ ᴀɴᴅ ꜱᴛᴀʀᴛꜱ ᴘʟᴀʏɪɴɢ ᴛʜᴇ ꜱᴇᴀʀᴄʜᴇᴅ ᴛʀᴀᴄᴋ ɪɴꜱᴛᴀɴᴛʟʏ ᴡɪᴛʜᴏᴜᴛ ᴅɪꜱᴛᴜʀʙɪɴɢ/clearing queue.

/channelplay [ᴄʜᴀᴛ ᴜꜱᴇʀɴᴀᴍᴇ ᴏʀ ɪᴅ] ᴏʀ [ᴅɪꜱᴀʙʟᴇ] - ᴄᴏɴɴᴇᴄᴛ ᴄʜᴀɴɴᴇʟ ᴛᴏ ᴀ ɢʀᴏᴜᴘ ᴀɴᴅ ꜱᴛʀᴇᴀᴍ ᴍᴜꜱɪᴄ ᴏɴ ᴄʜᴀɴɴᴇʟ ᴠᴏɪᴄᴇ ᴄʜᴀᴛ ғʀᴏᴍ ʏᴏᴜʀ ɢʀᴏᴜᴘ.


#BOT COMMANDS
✅ʙᴏᴛ'ꜱ  ꜱᴇʀᴠᴇʀ ᴘʟᴀʏʟɪꜱᴛꜱ:
/playlist  - ᴄʜᴇᴄᴋ ʏᴏᴜʀ ꜱᴀᴠᴇᴅ ᴘʟᴀʏʟɪꜱᴛ ᴏɴ ꜱᴇʀᴠᴇʀꜱ.
/deleteplaylist - ᴅᴇʟᴇᴛᴇ ᴀɴʏ ꜱᴀᴠᴇᴅ ᴍᴜꜱɪᴄ ɪɴ ʏᴏᴜʀ ᴘʟᴀʏʟɪꜱᴛ
/play  - ꜱᴛᴀʀᴛ ᴘʟᴀʏɪɴɢ ʏᴏᴜʀ ꜱᴀᴠᴇᴅ ᴘʟᴀʏʟɪꜱᴛ ғʀᴏᴍ ꜱᴇʀᴠᴇʀꜱ."""


bot_cmd = """✅ʙᴏᴛ ᴄᴏᴍᴍᴀɴᴅꜱ:

/stats - ɢᴇᴛ ᴛᴏᴘ 10 ᴛʀᴀᴄᴋꜱ ɢʟᴏʙᴀʟ ꜱᴛᴀᴛꜱ, ᴛᴏᴘ 10 ᴜꜱᴇʀꜱ ᴏғ ʙᴏᴛ, ᴛᴏᴘ 10 ᴄʜᴀᴛꜱ ᴏɴ ʙᴏᴛ, ᴛᴏᴘ 10 ᴘʟᴀʏᴇᴅ ɪɴ ᴀ ᴄʜᴀᴛ ᴇᴛᴄ ᴇᴛᴄ.

/sudolist - ᴄʜᴇᴄᴋ sᴜᴅᴏ ᴜsᴇʀs ᴏғ ᴀʙɢ  ʙᴏᴛ

/lyrics [ᴍᴜsɪᴄ ɴᴀᴍᴇ] - sᴇᴀʀᴄʜᴇs ʟʏʀɪᴄs ғᴏʀ ᴛʜᴇ ᴘᴀʀᴛɪᴄᴜʟᴀʀ ᴍᴜsɪᴄ ᴏɴ ᴡᴇʙ.

/song [ᴛʀᴀᴄᴋ ɴᴀᴍᴇ] or [ʏᴛ ʟɪɴᴋ] - ᴅᴏᴡɴʟᴏᴀᴅ ᴀɴʏ ᴛʀᴀᴄᴋ ғʀᴏᴍ ʏᴏᴜᴛᴜʙᴇ ɪɴ ᴍᴘ3 or ᴍᴘ4 ғᴏʀᴍᴀᴛꜱ.

/player -  ɢᴇt ᴀ ɪɴᴛᴇʀᴀᴄᴛɪᴠᴇ ᴘʟᴀʏɪɴɢ ᴘᴀɴᴇʟ.

c stands for channel play.

/queue or /cqueue- Check Queue List of Music."""


# EXTRA CHUTIYAPA
extra_chutiyapa = """✅ᴇxᴛʀᴀ  ᴄᴏᴍᴍᴀɴᴅꜱ:
/start - ꜱᴛᴀʀᴛ ᴛʜᴇ ᴍᴜꜱɪᴄ ʙᴏᴛ.
/help  - ɢᴇᴛ ᴄᴏᴍᴍᴀɴᴅꜱ ʜᴇʟᴘᴇʀ ᴍᴇɴᴜ ᴡɪᴛʜ ᴅᴇᴛᴀɪʟᴇᴅ ᴇxᴘʟᴀɴᴀᴛɪᴏɴꜱ ᴏғ ᴄᴏᴍᴍᴀɴᴅꜱ.
/ping- ᴘɪɴɢ ᴛʜᴇ ʙᴏᴛ ᴀɴᴅ ᴄʜᴇᴄᴋ ʀᴀᴍ, ᴄᴘᴜ ᴇᴛᴄ ꜱᴛᴀᴛꜱ ᴏғ ʙᴏᴛ.

✅ɢʀᴏᴜᴘ ꜱᴇᴛᴛɪɴɢꜱ:
/settings - ɢᴇᴛ a ᴄᴏᴍᴘʟᴇᴛᴇ ɢʀᴏᴜᴘ'ꜱ ꜱᴇᴛᴛɪɴɢꜱ ᴡɪᴛʜ ɪɴʟɪɴᴇ ʙᴜᴛᴛᴏɴꜱ

🔗 ᴏᴘᴛɪᴏɴꜱ ɪɴ ꜱᴇᴛᴛɪɴɢꜱ:
1️⃣ ʏᴏᴜ ᴄᴀɴ ꜱᴇᴛ ᴀᴜᴅɪᴏ ϙᴜᴀʟɪᴛʏ ʏᴏᴜ ᴡᴀɴᴛ ᴛᴏ ꜱᴛʀᴇᴀᴍ ᴏɴ ᴠᴏɪᴄᴇ cʏhat.

2️⃣ ʏᴏᴜ ᴄᴀɴ ꜱᴇᴛ ᴠɪᴅᴇᴏ ϙᴜᴀʟɪᴛʏ ʏᴏᴜ ᴡᴀɴᴛ ᴛᴏ ꜱᴛʀᴇᴀᴍ ᴏɴ ᴠᴏɪᴄᴇ ᴄʜᴀᴛ.

3️⃣ ᴀᴜᴛʜ ᴜꜱᴇʀꜱ:- ʏᴏᴜ can ᴄʜᴀɴɢᴇ ᴀᴅᴍɪɴ ᴄᴏᴍᴍᴀɴᴅꜱ ᴍᴏᴅᴇ ғʀᴏᴍ ʜᴇʀᴇ ᴛᴏ ᴇᴠᴇʀʏᴏɴᴇ ᴏʀ ᴀᴅᴍɪɴꜱ ᴏɴʟʏ. ɪғ ᴇᴠᴇʀʏᴏɴᴇ, ᴀɴʏᴏɴᴇ ᴘʀᴇꜱᴇɴᴛ ɪɴ ʏᴏᴜ ɢʀᴏᴜᴘ ᴡɪʟʟ ʙᴇ ᴀʙʟᴇ ᴛᴏ ᴜsᴇ ᴀᴅᴍɪɴ ᴄᴏᴍᴍᴀɴᴅs(like /skip, /stop ᴇᴛᴄ)

4️⃣ ᴄʟᴇᴀɴ ᴍᴏᴅᴇ: ᴡʜᴇɴ ᴇɴᴀʙʟᴇᴅ ᴅᴇʟᴇᴛᴇs ᴛʜᴇ ʙᴏᴛ's ᴍᴇssᴀɢᴇs ᴀғᴛᴇʀ 5 ᴍɪɴs ғʀᴏᴍ ʏᴏᴜʀ ɢʀᴏᴜᴘ ᴛᴏ ᴍᴀᴋᴇ sᴜʀᴇ ʏᴏᴜʀ ᴄʜᴀᴛ reʏmains ᴄʟᴇᴀɴ ᴀɴᴅ ɢᴏᴏᴅ.

5️⃣ ᴄᴏᴍᴍᴀɴᴅ ᴄʟᴇᴀɴ : ᴡʜᴇɴ ᴀᴄᴛɪᴠᴀᴛᴇᴅ, ʙᴏᴛ ᴡɪʟʟ ᴅᴇʟᴇᴛᴇ ɪᴛs ᴇxᴇᴄᴜᴛᴇᴅ ᴄᴏᴍᴍᴀɴᴅs (/play, /pause, /shuffle, /stop etc) ɪᴍᴍᴇᴅɪᴀᴛᴇʟʏ.

6️⃣ ᴘʟᴀʏ sᴇᴛᴛɪɴɢs:

/playmode - ɢᴇᴛ ᴀ ᴄᴏᴍᴘʟᴇᴛᴇ ᴘʟᴀʏ sᴇᴛᴛɪɴɢs ᴘᴀɴᴇʟ ᴡɪᴛʜ ʙᴜᴛᴛᴏɴs ᴡʜᴇʀᴇ ʏᴏᴜ ᴄᴀɴ ꜱᴇᴛ tour ɢʀᴏᴜᴘ ᴘʟᴀʏ sᴇᴛᴛɪɴɢs. 

ᴏᴘᴛɪᴏɴꜱ ɪɴ ᴘʟᴀʏᴍᴏᴅᴇ:

1️⃣ ꜱᴇᴀʀᴄʜ ᴍᴏᴅᴇ [ᴅɪʀᴇᴄᴛ ᴏʀ ɪɴʟɪɴᴇ] - ᴄʜᴀɴɢᴇꜱ ʏᴏᴜʀ ꜱᴇᴀʀᴄʜ ᴍᴏᴅᴇ ᴡʜɪʟᴇ ʏᴏᴜ ɢɪᴛᴠᴇ /ᴘʟᴀʏ mode. 

2️⃣ ᴀᴅᴍɪɴ ᴄᴏᴍᴍᴀɴᴅs [ᴇᴠᴇʀʏᴏɴᴇ ᴏʀ ᴀᴅᴍɪɴs] - ɪғ ᴇᴠᴇʀʏᴏɴᴇ, ᴀɴʏᴏɴᴇ ᴘʀᴇsᴇɴᴛ ɪɴ ʏᴏᴜ ɢʀᴏᴜᴘ ᴡɪʟʟ ʙᴇ ᴀʙʟᴇ ᴛᴏ ᴜsᴇ ᴀᴅᴍɪɴ ᴄᴏᴍᴍᴀɴᴅs(like /skip, /stop etc)

3️⃣ Play Type [ᴇᴠᴇʀʏᴏɴᴇ ᴏʀ ᴀᴅᴍɪɴs] - ɪғ ᴀᴅᴍɪɴs, ᴏɴʟʏ ᴀᴅᴍɪɴs ᴘʀᴇsᴇɴᴛ ɪɴ ɢʀᴏᴜᴘ ᴄᴀɴ ᴘʟᴀʏ ᴍᴜsɪᴄ on ᴠᴏɪᴄᴇ ᴄʜᴀᴛ."""


# RMDI ʟᴏɢ
sudo_cmd = """🔰ᴀᴅᴅ & ʀᴇᴍᴏᴠᴇ sᴜᴅᴏ ᴜsᴇʀs :
/addsudo [ᴜsᴇʀɴᴀᴍᴇ or ʀᴇᴘʟʏ ᴛᴏ ᴀ ᴜsᴇʀ]
/delsudo [Username or ʀᴇᴘʟʏ ᴛᴏ ᴀ ᴜsᴇʀ]

🛃ʜᴇʀᴏᴋᴜ:
/usage - ᴅʏɴᴏ ᴜsᴀɢᴇ.

🌐ᴄᴏɴғɪɢ ᴠᴀʀs:
/get_var - ɢᴇᴛ ᴀ ᴄᴏɴғɪɢ ᴠᴀʀ ғʀᴏᴍ ʜᴇʀᴏᴋᴜ or .env.
/del_var - ᴅᴇʟᴇᴛᴇ ᴀɴʏ ᴠᴀʀ ᴏɴ ʜᴇʀᴏᴋᴜ ᴏʀ .env.
/set_var [Var Name] [ᴠᴀʟᴜᴇ] - Set a Var or Update a Var on ʜᴇʀᴏᴋᴜ ᴏʀ .ᴇɴᴠ. sᴇᴘᴇʀᴀᴛᴇ ᴠᴀʀ ᴀɴᴅ ɪᴛs ᴠᴀʟᴜᴇ ᴡɪᴛʜ ᴀ sᴘᴀᴄᴇ.

🤖ʙᴏᴛ ᴄᴏᴍᴍᴀɴᴅs:
/reboot - ʀᴇʙᴏᴏᴛ ʏᴏᴜʀ ʙᴏᴛ. 
/update - ᴜᴘᴅᴀᴛᴇ ʙᴏᴛ.
/speedtest - ᴄʜᴇᴄᴋ sᴇʀᴠᴇʀ sᴘᴇᴇᴅs
/maintenance [enable / disable] 
/logger [enable / disable] - ʙᴏᴛ ʟᴏɢs ᴛʜᴇ sᴇᴀʀᴄʜᴇᴅ ǫᴜᴇʀɪᴇs ɪɴ ʟᴏɢɢᴇʀ ɢʀᴏᴜᴘ.
/get_log [Number of Lines] - ɢᴇᴛ log ᴏғ ʏᴏᴜʀ ʙᴏᴛ ғʀᴏᴍ ʜᴇʀᴏᴋᴜ ᴏʀ ᴠᴘs. ᴡᴏʀᴋs ғᴏʀ ʙᴏᴛʜ.
/autoend [enable|disable] - ᴇɴᴀʙʟᴇ ᴀᴜᴛᴏ sᴛʀᴇᴀᴍ ᴇɴᴅ ᴀғᴛᴇʀ 3 ᴍɪɴs ɪғ ɴᴏ ᴏɴᴇ ɪs ʟɪsᴛᴇɴɪɴɢ.

📈sᴛᴀᴛs ᴄᴏᴍᴍᴀɴᴅs:
/activevoice - ᴄʜᴇᴄᴋ ᴀᴄᴛɪᴠᴇ ᴠᴏɪᴄᴇ ᴄʜᴀᴛs ᴏɴ ʙᴏᴛ.
/activevideo - ᴄʜᴇᴄᴋ ᴀᴄᴛɪᴠᴇ ᴠɪᴅᴇᴏ ᴄᴀʟʟs ᴏɴ ʙᴏᴛ.
/stats - ᴄʜᴇᴄᴋ ʙᴏᴛs sᴛᴀᴛs

⚠️ʙʟᴀᴄᴋʟɪsᴛ ᴄʜᴀᴛ ғᴜɴᴄᴛɪᴏɴ:
/blacklistchat [CHAT_ID] - ʙʟᴀᴄᴋʟɪsᴛ ᴀɴʏ ᴄʜᴀᴛ ғʀᴏᴍ ᴜsɪɴɢ ᴍᴜsɪᴄ ʙᴏᴛ
/whitelistchat [CHAT_ID] - ᴡʜɪᴛᴇʟɪsᴛ ᴀɴʏ ʙʟᴀᴄᴋʟɪsᴛᴇᴅ ᴄʜᴀᴛ ғʀᴏᴍ ᴜsɪɴɢ ᴍᴜsɪᴄ ʙᴏᴛ
/blacklistedchat - ᴄʜᴇᴄᴋ ᴀʟʟ ʙʟᴀᴄᴋʟɪsᴛᴇᴅ ᴄʜᴀᴛs.

👤ʙʟᴏᴄᴋᴇᴅ ғᴜɴᴄᴛɪᴏɴ:
/block [Username or Reply to a user] - ᴘʀᴇᴠᴇɴᴛs ᴀ ᴜsᴇʀ ғʀᴏᴍ ᴜsɪɴɢ ʙᴏᴛ ᴄᴏᴍᴍᴀɴᴅs.
/unblock [Username or Reply to a user] - ʀᴇᴍᴏᴠᴇ ᴀ ᴜsᴇʀ ғʀᴏᴍ ʙᴏᴛ's ʙʟᴏᴄᴋᴇᴅ ʟɪsᴛ.
/blockedusers - ᴄʜᴇᴄᴋ ʙʟᴏᴄᴋᴇᴅ ᴜsᴇʀs ʟɪsᴛs

👤ɢʙᴀɴ ғᴜɴᴄᴛɪᴏɴ:
/gban [ᴜsᴇʀɴᴀᴍᴇ ᴏʀ ʀᴇᴘʟʏ ᴛᴏ ᴀ ᴜsᴇʀ] - ɢʙᴀɴ ᴀ ᴜsᴇʀ ғʀᴏᴍ ʙᴏᴛ's sᴇʀᴠᴇᴅ ᴄʜᴀᴛ ᴀɴᴅ sᴛᴏᴘ ʜɪᴍ ғʀᴏᴍ ᴜsɪɴɢ ʏᴏᴜʀ ʙᴏᴛ.
/ungban [ᴜsᴇʀɴᴀᴍᴇ ᴏʀ ʀᴇᴘʟʏ ᴛᴏ ᴀ ᴜsᴇʀ] - ʀᴇᴍᴏᴠᴇ ᴀ ᴜsᴇʀ ғʀᴏᴍ ʙᴏᴛ's ɢʙᴀɴɴᴇᴅ ʟɪsᴛ ᴀɴᴅ ᴀʟʟᴏᴡ ʜɪᴍ ғᴏʀ ᴜsɪɴɢ ʏᴏᴜʀ ʙᴏᴛ
/gbannedusers - ᴄʜᴇᴄᴋ ɢʙᴀɴɴᴇᴅ ᴜsᴇʀs ʟɪsᴛs

🎥ᴠɪᴅᴇᴏᴄᴀʟʟs ғᴜɴᴄᴛɪᴏɴ:
/set_video_limit [ɴᴜᴍʙᴇʀ ᴏғ ᴄʜᴀᴛs] - sᴇᴛ ᴀ ᴍᴀxɪᴍᴜᴍ ɴᴜᴍʙᴇʀ ᴏғ ᴄʜᴀᴛs ᴀʟʟᴏᴡᴇᴅ ғᴏʀ ᴠɪᴅᴇᴏ ᴄᴀʟʟs ᴀᴛ ᴀ ᴛɪᴍᴇ. ᴅᴇғᴀᴜʟᴛ ᴛᴏ 3 ᴄʜᴀᴛs.
/videomode [ᴅᴏᴡɴʟᴏᴀᴅ |m3u8] - If ᴅᴏᴡɴʟᴏᴀᴅ ᴍᴏᴅᴇ ɪs ᴇɴᴀʙʟᴇᴅ, ʙᴏᴛ ᴡɪʟʟ ᴅᴏᴡɴʟᴏᴀᴅ ᴠɪᴅᴇᴏs ɪɴsᴛᴇᴀᴅ ᴏғ ᴘʟᴀʏɪɴɢ ᴛʜᴇᴍ ɪɴ ᴍ3u8 ғᴏʀᴍ. ʙʏ ᴅᴇғᴀᴜʟᴛ ᴛᴏ ᴍ3u8. ʏᴏᴜ ᴄᴀɴ ᴜsᴇ ᴅᴏᴡɴʟᴏᴀᴅ ᴍᴏᴅᴇ ᴡʜᴇɴ ᴀɴʏ ǫᴜᴇʀʏ ᴅᴏᴇsɴᴛ ᴘʟᴀʏs ɪɴ ᴍ3u8 ᴍᴏᴅᴇ.

⚡️ᴘʀɪᴠᴀᴛᴇ ʙᴏᴛ ғᴜɴᴄᴛɪᴏɴ:
/authorize [CHAT_ID] - ᴀʟʟᴏᴡ ᴀ ᴄʜᴀᴛ ғᴏʀ ᴜsɪɴɢ ʏᴏᴜʀ ʙᴏᴛ.
/unauthorize [CHAT_ID] - ᴅɪsᴀʟʟᴏᴡ ᴀ ᴄʜᴀᴛ ғʀᴏᴍ ᴜsɪɴɢ ʏᴏᴜʀ ʙᴏᴛ.
/authorized - ᴄʜᴇᴄᴋ ᴀʟʟ ᴀʟʟᴏᴡᴇᴅ ᴄʜᴀᴛs ᴏғ ʏᴏᴜʀ ʙᴏᴛ.

🌐ʙʀᴏᴀᴅᴄᴀsᴛ ғᴜɴᴄᴛɪᴏɴ:
/broadcast [ᴍᴇssᴀɢᴇ ᴏʀ ʀᴇᴘʟʏ ᴛᴏ ᴀ ᴍᴇssᴀɢᴇ] - ʙʀᴏᴀᴅᴄᴀsᴛ ᴀɴʏ ᴍᴇssᴀɢᴇ ᴛᴏ ʙᴏᴛ's sᴇʀᴠᴇᴅ ᴄʜᴀᴛs.

ᴏᴘᴛɪᴏɴs ғᴏʀ ʙʀᴏᴀᴅᴄᴀsᴛ:
-pin : ᴛʜɪs ᴡɪʟʟ ᴘɪɴ ʏᴏᴜʀ ᴍᴇssᴀɢᴇ 
-pinloud : ᴛʜɪs ᴡɪʟʟ ᴘɪɴ ʏᴏᴜʀ ᴍᴇssᴀɢᴇ ᴡɪᴛʜ ʟᴏᴜᴅ ɴᴏᴛɪғɪᴄᴀᴛɪᴏɴ
-user : ᴛʜɪs ᴡɪʟʟ ʙʀᴏᴀᴅᴄᴀsᴛ ʏᴏᴜʀ ᴍᴇssᴀɢᴇ ᴛᴏ ᴛʜᴇ ᴜsᴇʀs ᴡʜᴏ ʜᴀᴠᴇ sᴛᴀʀᴛᴇᴅ ʏᴏᴜʀ ʙᴏᴛ.
-assistant : ᴛʜɪs ᴡɪʟʟ ʙʀᴏᴀᴅᴄᴀsᴛ ʏᴏᴜʀ ᴍᴇssᴀɢᴇ ғʀᴏᴍ ᴀssɪsᴛᴀɴᴛ ᴀᴄᴄᴏᴜɴᴛ ᴏғ ʏᴏᴜʀ ʙᴏᴛ.
-nobot : ᴛʜɪs will ғᴏʀᴄᴇ ʏᴏᴜʀ ʙᴏᴛ ᴛᴏ ɴᴏᴛ ʙʀᴏᴀᴅᴄᴀsᴛ ᴍᴇssᴀɢᴇ

ᴇxᴀᴍᴘʟᴇ: `/broadcast -user -assistant -pin Hello Testing` """
